David-OConnor/stm32-hal/src/timer.rs
            impl CountDown for Timer<$TIMX> {
                type Time = f32;

                fn start<T>(&mut self, timeout: T)
                where
                    T: Into<f32>,  // Hz.
                {
                    self.disable();

                    self.set_freq(timeout.into(), self.clock_speed).ok();

                    // Trigger an update event to load the prescaler value to the clock
                    // NOTE(write): uses all bits in this register.
                    self.tim.egr.write(|w| w.ug().update());
                    // The above line raises an update event which will indicate
                    // that the timer is already finished. Since this is not the case,
                    // it should be cleared
                    self.clear_update_interrupt_flag();

                    // start counter
                    self.enable();
                }

                fn wait(&mut self) -> nb::Result<(), Void> {
                    if self.tim.sr.read().uif().is_clear() {
                        Err(nb::Error::WouldBlock)
                    } else {
                        self.clear_update_interrupt_flag();
                        Ok(())
                    }
                }
            }

            impl Timer<$TIMX> {
                /// Configures a TIM peripheral as a periodic count down timer
                pub fn $tim<T:, C>(tim: $TIMX, freq: T, clocks: &C, rcc: &mut RCC) -> Self
                where
                    T: Into<f32>,
                    C: ClockCfg,
                {
                    // `freq` is in Hz.

                    // enable and reset peripheral to a clean slate state
                    // todo: Feature-gate, adn use the right apb1 vs apb2.

                    cfg_if::cfg_if! {
                        if #[cfg(any(
                            feature = "stm32f301",
                            feature = "stm32f302",
                            feature = "stm32f303",
                            feature = "stm32f373",
                            feature = "stm32f3x4"
                        ))] {
                            paste! {
                                rcc.[<$apb enr>].modify(|_, w| w.[<$tim en>]().set_bit());
                                rcc.[<$apb rstr>].modify(|_, w| w.[<$tim rst>]().set_bit());
                                rcc.[<$apb rstr>].modify(|_, w| w.[<$tim rst>]().clear_bit());
                            }
                        } else if # [cfg(any(
                            feature = "stm32l4x1",
                            feature = "stm32l4x2",
                            feature = "stm32l4x3",
                            feature = "stm32l4x5",
                            feature = "stm32l4x6"
                        ))] {
                            paste! {
                                // We use `$enr` and $rst, since we only add `1` after for apb1.
                                // This isn't required on f3.
                                rcc.[<$apb $enr>].modify(|_, w| w.[<$tim en>]().set_bit());
                                rcc.[<$apb $rst>].modify(|_, w| w.[<$tim rst>]().set_bit());
                                rcc.[<$apb $rst>].modify(|_, w| w.[<$tim rst>]().clear_bit());
                            }
                        }
                    }

                    paste! {
                        let mut timer = Timer { clock_speed: clocks.[<$apb _timer>](), tim };

                        timer.start(freq);

                        timer
                    }
                }

                /// Starts listening for an `event`
                pub fn listen(&mut self, event: Event) {
                    match event {
                        // Enable update event interrupt
                        Event::TimeOut => self.tim.dier.write(|w| w.uie().set_bit()),
                    }
                }

                /// Enable the timer.
                pub fn enable(&mut self) {
                    self.tim.cr1.modify(|_, w| w.cen().set_bit());
                }

                /// Disable the timer.
                pub fn disable(&mut self) {
                    self.tim.cr1.modify(|_, w| w.cen().clear_bit());
                }

                /// Clears interrupt associated with `event`.
                ///
                /// If the interrupt is not cleared, it will immediately retrigger after
                /// the ISR has finished.
                pub fn clear_interrupt(&mut self, event: Event) {
                    match event {
                        Event::TimeOut => {
                            // Clear interrupt flag
                            self.tim.sr.write(|w| w.uif().clear_bit());
                        }
                    }
                }

                /// Stops listening for an `event`
                pub fn unlisten(&mut self, event: Event) {
                    match event {
                        // Disable update event interrupt
                        Event::TimeOut => self.tim.dier.write(|w| w.uie().clear_bit()),
                    }
                }

                /// Clears Update Interrupt Flag
                pub fn clear_update_interrupt_flag(&mut self) {
                    self.tim.sr.modify(|_, w| w.uif().clear_bit());
                }

                /// Releases the TIM peripheral
                pub fn free(mut self) -> $TIMX {
                    self.disable();
                    self.tim
                }

                /// Set the timer frequency, in Hz. Overrides the period or frequency set
                /// in the constructor.
                pub fn set_freq(&mut self, freq: f32, clock_speed: u32) -> Result<(), ValueError> {
                   let (psc, arr) = calc_freq_vals(freq, self.clock_speed)?;

                    self.tim.arr.write(|w| unsafe { w.bits(arr.into()) });
                    self.tim.psc.write(|w| unsafe { w.bits(psc.into()) });

                    Ok(())
                }

                /// Reset the countdown; set the counter to 0.
                pub fn reset_countdown(&mut self) {
                    self.tim.cnt.write(|w| unsafe { w.bits(0) });
                }
            }
        )+
    }
}

/// Calculate values required to set the timer frequency: `PSC` and `ARR`. This can be
/// used for initial timer setup, or changing the value later.
fn calc_freq_vals(freq: f32, clock_speed: u32) -> Result<(u16, u16), ValueError> {
    // `period` and `clock_speed` are both in Hz.

    // PSC and ARR range: 0 to 65535
    // (PSC+1)*(ARR+1) = TIMclk/Updatefrequency = TIMclk * period
    // APB1 (pclk1) is used by Tim2, 3, 4, 6, 7.
    // APB2 (pclk2) is used by Tim8, 15-20 etc.

    // We need to factor the right-hand-side of the above equation (`rhs` variable)
    // into integers. There are likely clever algorithms available to do this.
    // Some examples: https://cp-algorithms.com/algebra/factorization.html
    // We've chosen something quick to write, and with sloppy precision;
    // should be good enough for most cases.

    // - If you work with pure floats, there are an infinite number of solutions: Ie for any value of PSC, you can find an ARR to solve the equation.
    // - The actual values are integers that must be between 0 and 65_536
    // - Different combinations will result in different amounts of rounding errors. Ideally, we pick the one with the lowest rounding error.
    // - The aboveapproach sets PSC and ARR always equal to each other.
    // This results in concise code, is computationally easy, and doesn't limit
    // the maximum period. There will usually be solutions that have a smaller rounding error.

    let max_val = 65_535;
    let rhs = clock_speed as f32 / freq;

