David-OConnor/stm32-hal/src/timer.rs
    let arr = rhs.sqrt().round() as u16 - 1;
    let psc = arr;

    if arr > max_val || psc > max_val {
        return Err(ValueError {});
    }

    Ok((psc, arr))
}

macro_rules! pwm_features {
    ($({
        $TIMX:ident: ($tim:ident, $apb:ident),
        $res:ident,
    },)+) => {
        $(
            impl Timer<$TIMX> {
                /// Set Output Compare Mode. See docs on the `OutputCompare` enum.
                pub fn set_output_compare(&mut self, channel: Channel, mode: OutputCompare) {
                    match channel {
                        Channel::One => {
                            self.tim.ccmr1_output().modify(|_, w| w.oc1m().bits(mode as u8));
                            cfg_if::cfg_if! {
                                if #[cfg(any(
                                    feature = "stm32f301",
                                    feature = "stm32f302",
                                    feature = "stm32f303",
                                    feature = "stm32f373",
                                    feature = "stm32f3x4"
                                ))] {
                                    self.tim.ccmr1_output().modify(|_, w| w.oc1m_3().bit(mode.left_bit()));
                            } else if # [cfg(any(
                                    feature = "stm32l4x1",
                                    feature = "stm32l4x2",
                                    feature = "stm32l4x3",
                                    feature = "stm32l4x5",
                                    feature = "stm32l4x6",
                                    feature = "stm32l552",
                                    feature = "stm32l562",
                                ))] {
                                self.tim.ccmr1_output().modify(|_, w| w.oc1m_2().bit(mode.left_bit()));
                                }
                            }
                        }
                        Channel::Two => {
                             self.tim.ccmr1_output().modify(|_, w| w.oc1m().bits(mode as u8));
                            cfg_if::cfg_if! {
                                if #[cfg(any(
                                    feature = "stm32f301",
                                    feature = "stm32f302",
                                    feature = "stm32f303",
                                    feature = "stm32f373",
                                    feature = "stm32f3x4"
                                ))] {
                                    self.tim.ccmr1_output().modify(|_, w| w.oc1m_3().bit(mode.left_bit()));
                            } else if # [cfg(any(
                                    feature = "stm32l4x1",
                                    feature = "stm32l4x2",
                                    feature = "stm32l4x3",
                                    feature = "stm32l4x5",
                                    feature = "stm32l4x6",
                                    feature = "stm32l552",
                                    feature = "stm32l562",
                                ))] {
                                self.tim.ccmr1_output().modify(|_, w| w.oc1m_2().bit(mode.left_bit()));
                                }
                            }
                        }
                        Channel::Three => {
                             self.tim.ccmr1_output().modify(|_, w| w.oc1m().bits(mode as u8));
                            cfg_if::cfg_if! {
                                if #[cfg(any(
                                    feature = "stm32f301",
                                    feature = "stm32f302",
                                    feature = "stm32f303",
                                    feature = "stm32f373",
                                    feature = "stm32f3x4"
                                ))] {
                                    self.tim.ccmr1_output().modify(|_, w| w.oc1m_3().bit(mode.left_bit()));
                            } else if # [cfg(any(
                                    feature = "stm32l4x1",
                                    feature = "stm32l4x2",
                                    feature = "stm32l4x3",
                                    feature = "stm32l4x5",
                                    feature = "stm32l4x6",
                                    feature = "stm32l552",
                                    feature = "stm32l562",
                                ))] {
                                self.tim.ccmr1_output().modify(|_, w| w.oc1m_2().bit(mode.left_bit()));
                                }
                            }
                        }
                        Channel::Four => {
                            self.tim.ccmr2_output().modify(|_, w| w.oc4m().bits(mode as u8));
                            self.tim.ccmr2_output().modify(|_, w| w.oc4m_3().bit(mode.left_bit()));
                        }
                    }
                }

                /// Return the set duty period for a given channel. Divide by `get_max_duty()`
                /// to find the portion of the duty cycle used.
                pub fn get_duty(&self, channel: Channel) -> $res {
                    match channel {
                        Channel::One => self.tim.ccr1.read().ccr().bits(),
                        Channel::Two => self.tim.ccr2.read().ccr().bits(),
                        Channel::Three => self.tim.ccr3.read().ccr().bits(),
                        Channel::Four => self.tim.ccr4.read().ccr().bits(),
                    }
                }

                /// Set the duty cycle, as a portion of `get_max_duty()`.
                pub fn set_duty(&mut self, channel: Channel, duty: $res) {
                    match channel {
                        Channel::One => self.tim.ccr1.write(|w| w.ccr().bits(duty)),
                        Channel::Two => self.tim.ccr2.write(|w| w.ccr().bits(duty)),
                        Channel::Three => self.tim.ccr3.write(|w| w.ccr().bits(duty)),
                        Channel::Four => self.tim.ccr4.write(|w| w.ccr().bits(duty)),
                    }
                }

