David-OConnor/stm32-hal/src/timer.rs
// todo: Which use apb1, and which use apb2? We have a good start, but needs QC

// todo: Fix pwm features for l4 and put back!

// We only implement `pwm_features` for general purpose timers. Perhaps we should implement
// for advanced-control timers too.

#[cfg(not(feature = "stm32f373"))]
hal! {
    {
        TIM1: (tim1, apb2, enr, rstr),
    },
}

#[cfg(not(any(feature = "stm32f552", feature = "stm32l4x3")))]
hal! {
    {
        TIM3: (tim3, apb1, enr1, rstr1),
    },
}

// #[cfg(not(feature = "stm32f552"))]
// pwm_features! {
//     {
//         TIM3: (tim3, apb1, enr1, rstr1),
//         u16,
//     },
// }

#[cfg(not(any(
    feature = "stm32l4x1",
    feature = "stm32l4x2",
    feature = "stm32l4x3",
    feature = "stm32l552"
)))]
hal! {
    {
        TIM4: (tim4, apb1, enr1, rstr1),
    },
    {
        TIM17: (tim17, apb2, enr, rstr),
    },
}

// #[cfg(not(any(
// feature = "stm32l4x1",
// feature = "stm32l4x2",
// feature = "stm32l4x3",
// feature = "stm32l552"
// )))]
// pwm_features! {
//     {
//         TIM4: (tim4, apb1),
//         u16,
//     },
// }

#[cfg(any(
    feature = "stm32f301",
    feature = "stm32f373",
    feature = "stm32l4x5",
    feature = "stm32l4x6",
    feature = "stm32l562"
))]
hal! {
    {
        TIM5: (tim5, apb1, enr1, rstr1),
    },
}

hal! {
    {
        TIM2: (tim2, apb1, enr1, rstr1),
    },
    {
        TIM6: (tim6, apb1, enr1, rstr1),
    },
        {
        TIM7: (tim7, apb1, enr1, rstr1),
    },
    {
        TIM15: (tim15, apb2, enr, rstr),
    },
    {
        TIM16: (tim16, apb2, enr, rstr),
    },
}

// pwm_features! {
//     {
//         TIM2: (tim2, apb1, enr1, rstr1),
//         u32,
//     },
// }

#[cfg(any(
    feature = "stm32f302",
    feature = "stm32f303",
    feature = "stm32l4x5",
    feature = "stm32l4x6",
    feature = "stm32l562",
))]
hal! {
    {
        TIM8: (tim8, apb2, enr, rstr),
    },
}

#[cfg(feature = "stm32f373")]
hal! {
    {
        TIM10: (tim10, apb2, enr, rstr),
    },
}

#[cfg(any(feature = "stm32f302", feature = "stm32f303"))]
hal! {
    // { todo This is causing duplicates when compiling with f303. Why?
    //     TIM18: (tim18, apb2, enr, rstr),
    // },
    {
        TIM20: (tim20, apb2, enr, rstr),
    },
}

#[cfg(any(feature = "stm32f301", feature = "stm32f373"))]
hal! {
    {
        TIM12: (tim12, apb1, enr1, rstr1),
    },
    {
        TIM13: (tim13, apb1, enr1, rstr1),
    },
    {
        TIM14: (tim14, apb1, enr1, rstr1),
    },
    {
        TIM19: (tim19, apb2, enr, rstr),
    },
}
